OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/incompressible/pimpleFoam/LES/periodicHill/steadyState/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet|outlet|front|back)"
    {
        type            cyclic;
    }

    "(top|hills)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
